{
    "exerciseCategories": [
        {
            "categoryName": "Chest + Arms",
            "emoji": "💪",
            "exercises": [
                {
                    "name": "Push-ups",
                    "description": "A basic exercise to strengthen the chest, shoulders, and triceps."
                },
                {
                    "name": "Tricep Dips",
                    "description": "An exercise targeting the triceps, performed on a bench or chair."
                },
                {
                    "name": "Bicep Curls",
                    "description": "A strength training exercise for the biceps using dumbbells."
                },
                {
                    "name": "Standing Chest/Shoulder Press",
                    "description": "An exercise to strengthen the shoulders and upper chest."
                },
                {
                    "name": "Shoulder Lifts",
                    "description": "An exercise to target the shoulder muscles."
                }
            ]
        },
        {
            "categoryName": "Abs",
            "emoji": "🧘",
            "exercises": [
                {
                    "name": "Sit-ups",
                    "description": "An exercise to strengthen the abdominal muscles by lifting the upper body towards the knees."
                },
                {
                    "name": "Bicycle Crunches",
                    "description": "A core exercise that combines a crunch with a pedaling motion."
                },
                {
                    "name": "Russian Twists",
                    "description": "An exercise that targets the obliques by twisting the torso while seated."
                },
                {
                    "name": "Spiderman",
                    "description": "A dynamic exercise that combines a plank with a knee drive towards the elbow."
                },
                {
                    "name": "Leg Raises",
                    "description": "An exercise to strengthen the lower abdominal muscles by lifting the legs while lying down."
                }
            ]
        },
        {
            "categoryName": "Legs",
            "emoji": "🦵",
            "exercises": [
                {
                    "name": "Squats",
                    "description": "A fundamental exercise that targets the quadriceps, hamstrings, and glutes."
                },
                {
                    "name": "Wide Squats",
                    "description": "A variation of squats that targets the inner thighs and glutes."
                },
                {
                    "name": "Lunges Left",
                    "description": "An exercise that targets the legs by stepping forward with one leg and lowering the body."
                },
                {
                    "name": "Lunges Right",
                    "description": "Similar to lunges left, but stepping forward with the right leg."
                },
                {
                    "name": "Calf Raises",
                    "description": "An exercise to strengthen the calf muscles by raising the heels off the ground."
                }
            ]
        }
    ]
}